Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lptim.c
  if (HAL_LPTIM_GetState(hlptim) == HAL_LPTIM_STATE_TIMEOUT)
  {
    return HAL_TIMEOUT;
  }

  /* Enable "switch to down direction" interrupt */
  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_DOWN);

  /* Enable "switch to up direction" interrupt */
  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_UP);

  /* Enable the Peripheral */
  __HAL_LPTIM_ENABLE(hlptim);

  /* Start timer in continuous mode */
  __HAL_LPTIM_START_CONTINUOUS(hlptim);

  /* Change the LPTIM state */
  hlptim->State = HAL_LPTIM_STATE_READY;

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Stop the Encoder interface in interrupt mode.
  * @param  hlptim LPTIM handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPTIM_Encoder_Stop_IT(LPTIM_HandleTypeDef *hlptim)
{
  /* Check the parameters */
  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));

  /* Set the LPTIM state */
  hlptim->State = HAL_LPTIM_STATE_BUSY;

  /* Disable the Peripheral */
  __HAL_LPTIM_DISABLE(hlptim);

  if (HAL_LPTIM_GetState(hlptim) == HAL_LPTIM_STATE_TIMEOUT)
  {
    return HAL_TIMEOUT;
  }

  /* Reset ENC bit to disable the encoder interface */
  hlptim->Instance->CFGR &= ~LPTIM_CFGR_ENC;

  /* Disable "switch to down direction" interrupt */
  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_DOWN);

  /* Disable "switch to up direction" interrupt */
  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_UP);

  /* Change the LPTIM state */
  hlptim->State = HAL_LPTIM_STATE_READY;

  /* Return function status */
  return HAL_OK;
}

///**
//  * @brief  Start the Timeout function.
//  * @note   The first trigger event will start the timer, any successive
//  *         trigger event will reset the counter and the timer restarts.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0001 and 0xFFFF.
//  * @param  Timeout Specifies the TimeOut value to reset the counter.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_TimeOut_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Timeout)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Timeout));

//  /* Set the LPTIM state */
//  hlptim->State = HAL_LPTIM_STATE_BUSY;

//  /* Set TIMOUT bit to enable the timeout function */
//  hlptim->Instance->CFGR |= LPTIM_CFGR_TIMOUT;

//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);

//  /* Clear flag */
//  __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_ARROK);

//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);

//  /* Wait for the completion of the write operation to the LPTIM_ARR register */
//  if (LPTIM_WaitForFlag(hlptim, LPTIM_FLAG_ARROK) == HAL_TIMEOUT)
//  {
//    return HAL_TIMEOUT;
//  }

//  /* Clear flag */
//  __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_CMPOK);

//  /* Load the Timeout value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Timeout);

//  /* Wait for the completion of the write operation to the LPTIM_CMP register */
//  if (LPTIM_WaitForFlag(hlptim, LPTIM_FLAG_CMPOK) == HAL_TIMEOUT)
//  {
//    return HAL_TIMEOUT;
//  }

//  /* Start timer in continuous mode */
//  __HAL_LPTIM_START_CONTINUOUS(hlptim);

//  /* Change the LPTIM state */
//  hlptim->State = HAL_LPTIM_STATE_READY;

//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the Timeout function.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_TimeOut_Stop(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));

//  /* Set the LPTIM state */
//  hlptim->State = HAL_LPTIM_STATE_BUSY;

//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);

//  if (HAL_LPTIM_GetState(hlptim) == HAL_LPTIM_STATE_TIMEOUT)
//  {
//    return HAL_TIMEOUT;
//  }

//  /* Reset TIMOUT bit to enable the timeout function */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_TIMOUT;

//  /* Change the LPTIM state */
//  hlptim->State = HAL_LPTIM_STATE_READY;

//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Start the Timeout function in interrupt mode.
//  * @note   The first trigger event will start the timer, any successive
//  *         trigger event will reset the counter and the timer restarts.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0001 and 0xFFFF.
//  * @param  Timeout Specifies the TimeOut value to reset the counter.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_TimeOut_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Timeout)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Timeout));

//  /* Set the LPTIM state */
//  hlptim->State = HAL_LPTIM_STATE_BUSY;

//  /* Enable EXTI Line interrupt on the LPTIM Wake-up Timer */
//  __HAL_LPTIM_WAKEUPTIMER_EXTI_ENABLE_IT();

//  /* Set TIMOUT bit to enable the timeout function */
//  hlptim->Instance->CFGR |= LPTIM_CFGR_TIMOUT;

//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);

//  /* Clear flag */
//  __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_ARROK);

//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);

//  /* Wait for the completion of the write operation to the LPTIM_ARR register */
//  if (LPTIM_WaitForFlag(hlptim, LPTIM_FLAG_ARROK) == HAL_TIMEOUT)
//  {
//    return HAL_TIMEOUT;
//  }

//  /* Clear flag */
//  __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_CMPOK);

//  /* Load the Timeout value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Timeout);

